packerlschupfer/ESP32-Logger/src/Logger.cpp
void Logger::logDirect(esp_log_level_t level, const char* tag, const char* message) {
    if (!message) return;  // Prevent nullptr dereference
    if (!isLevelEnabledForTag(tag, level)) return;
    // Note: logDirect intentionally bypasses rate limiting but still notifies subscribers

    // Notify subscribers with the raw message
    notifySubscribers(level, tag, message);

    auto& pool = BufferPool::getInstance();

    char* fullMessage = pool.acquire();
    if (fullMessage) {
        int len = snprintf(fullMessage, CONFIG_LOG_BUFFER_SIZE,
                          "[%lu][%s][%s] %s: %s\r\n",
                          millis(),
                          pcTaskGetName(NULL) ?: "?",
                          levelToString(level),
                          tag ?: "?",
                          message);

        writeToBackends(fullMessage, len);
        pool.release(fullMessage);
    } else {
        esp_log_write(level, tag, "%s", message);
    }
}

void Logger::flush() {
    // Flush directly without mutex if scheduler not started (single-threaded)
    if (!backendMutex) {
        for (auto& backend : backends) {
            if (backend) {
                backend->flush();
            }
        }
        return;
    }

    if (xSemaphoreTake(backendMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        for (auto& backend : backends) {
            if (backend) {
                backend->flush();
            }
        }
        xSemaphoreGive(backendMutex);
    }
}

void Logger::resetDroppedLogs() {
    droppedLogs.store(0);
}

void Logger::enableESPLogRedirection() {
    // Redirect ESP-IDF logs through our logger
    esp_log_set_vprintf(&esp_log_redirect);
}

// Log subscriber implementation
bool Logger::addLogSubscriber(LogSubscriberCallback callback) {
    if (callback == nullptr) {
        return false;
    }

    // Thread safety - only if mutex available
    if (subscriberMutex && xSemaphoreTake(subscriberMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) != pdTRUE) {
        return false;
    }

    bool result = false;
    uint8_t count = subscriberCount.load();

    // Check for duplicates and available slots
    if (count < MAX_SUBSCRIBERS) {
        bool isDuplicate = false;
        for (uint8_t i = 0; i < count; i++) {
            if (subscribers[i] == callback) {
                isDuplicate = true;
                break;
            }
        }

        if (!isDuplicate) {
            subscribers[count] = callback;
            subscriberCount.store(count + 1);
            result = true;
        }
    }

    if (subscriberMutex) {
        xSemaphoreGive(subscriberMutex);
    }

    return result;
}

bool Logger::removeLogSubscriber(LogSubscriberCallback callback) {
    if (callback == nullptr) {
        return false;
    }

    if (subscriberMutex && xSemaphoreTake(subscriberMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) != pdTRUE) {
        return false;
    }

    bool result = false;
    uint8_t count = subscriberCount.load();

    for (uint8_t i = 0; i < count; i++) {
        if (subscribers[i] == callback) {
            // Shift remaining subscribers down
            for (uint8_t j = i; j < count - 1; j++) {
                subscribers[j] = subscribers[j + 1];
            }
            count--;
            subscribers[count] = nullptr;
            subscriberCount.store(count);
            result = true;
            break;
        }
    }

    if (subscriberMutex) {
        xSemaphoreGive(subscriberMutex);
    }

    return result;
}

bool Logger::startSubscriberTask(int coreId) {
    // Already running?
    if (subscriberTaskHandle != nullptr) {
        return true;
    }

    // Create queue if not exists
    if (subscriberQueue == nullptr) {
        subscriberQueue = xQueueCreate(CONFIG_LOG_SUBSCRIBER_QUEUE_SIZE, sizeof(LogSubscriberMessage));
        if (subscriberQueue == nullptr) {
            return false;
        }
    }

    subscriberTaskRunning.store(true);

    // Create task with optional core affinity
    BaseType_t result;
    if (coreId >= 0 && coreId <= 1) {
        result = xTaskCreatePinnedToCore(
            subscriberTaskFunc,
            "LogSub",
            CONFIG_LOG_SUBSCRIBER_TASK_STACK,
            this,
            CONFIG_LOG_SUBSCRIBER_TASK_PRIORITY,
            &subscriberTaskHandle,
            coreId
        );
    } else {
        result = xTaskCreate(
            subscriberTaskFunc,
            "LogSub",
            CONFIG_LOG_SUBSCRIBER_TASK_STACK,
            this,
            CONFIG_LOG_SUBSCRIBER_TASK_PRIORITY,
            &subscriberTaskHandle
        );
    }

    if (result != pdPASS) {
        subscriberTaskRunning.store(false);
        subscriberTaskHandle = nullptr;
        return false;
    }

    return true;
}

void Logger::stopSubscriberTask() {
    if (subscriberTaskHandle == nullptr) {
        return;
    }

    // Signal task to stop
    subscriberTaskRunning.store(false);

    // Send a dummy message to wake up the task if it's blocked on queue
    if (subscriberQueue) {
        LogSubscriberMessage dummy = {};
        xQueueSend(subscriberQueue, &dummy, 0);
    }

    // Wait for task to finish (with timeout)
    for (int i = 0; i < 50 && subscriberTaskHandle != nullptr; i++) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    // Force delete if still running
    if (subscriberTaskHandle != nullptr) {
        vTaskDelete(subscriberTaskHandle);
        subscriberTaskHandle = nullptr;
    }

    // Clean up queue
    if (subscriberQueue) {
        vQueueDelete(subscriberQueue);
        subscriberQueue = nullptr;
    }
}

void Logger::subscriberTaskFunc(void* param) {
    Logger* logger = static_cast<Logger*>(param);
    LogSubscriberMessage msg;

    while (logger->subscriberTaskRunning.load()) {
        // Wait for message (with timeout to check running flag)
        if (xQueueReceive(logger->subscriberQueue, &msg, pdMS_TO_TICKS(100)) == pdTRUE) {
            // Check if we should stop
            if (!logger->subscriberTaskRunning.load()) {
                break;
            }

            // Get a snapshot of callbacks
            Logger::LogSubscriberCallback localCallbacks[MAX_SUBSCRIBERS];
            uint8_t localCount = 0;

