packerlschupfer/ESP32-Logger/src/Logger.cpp
            if (logger->subscriberMutex &&
                xSemaphoreTake(logger->subscriberMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
                localCount = logger->subscriberCount.load();
                for (uint8_t i = 0; i < localCount; i++) {
                    localCallbacks[i] = logger->subscribers[i];
                }
                xSemaphoreGive(logger->subscriberMutex);
            }

            // Invoke callbacks (without mutex held)
            for (uint8_t i = 0; i < localCount; i++) {
                if (localCallbacks[i] != nullptr) {
                    localCallbacks[i](msg.level, msg.tag, msg.message);
                }
            }
        }
    }

    // Clean exit
    logger->subscriberTaskHandle = nullptr;
    vTaskDelete(nullptr);
}

void Logger::notifySubscribers(esp_log_level_t level, const char* tag, const char* message) {
    // Fast path - no subscribers registered (atomic load is cheap)
    if (subscriberCount.load() == 0) {
        return;
    }

    // Safety check - don't queue from ISR context
    if (xPortInIsrContext()) {
        return;
    }

    // If queue exists, use async notification (preferred)
    if (subscriberQueue) {
        LogSubscriberMessage msg;
        msg.level = level;

        // Safe string copy with null termination
        if (tag) {
            strncpy(msg.tag, tag, CONFIG_LOG_SUBSCRIBER_TAG_SIZE - 1);
            msg.tag[CONFIG_LOG_SUBSCRIBER_TAG_SIZE - 1] = '\0';
        } else {
            msg.tag[0] = '\0';
        }

        if (message) {
            strncpy(msg.message, message, CONFIG_LOG_SUBSCRIBER_MSG_SIZE - 1);
            msg.message[CONFIG_LOG_SUBSCRIBER_MSG_SIZE - 1] = '\0';
        } else {
            msg.message[0] = '\0';
        }

        // Non-blocking send - drop message if queue is full
        xQueueSend(subscriberQueue, &msg, 0);
        return;
    }

    // Fallback: synchronous notification (legacy behavior, not recommended)
    // Only used if startSubscriberTask() was never called

    // Copy callbacks while holding mutex to avoid calling with mutex held
    LogSubscriberCallback localCallbacks[MAX_SUBSCRIBERS];
    uint8_t localCount = 0;

    if (subscriberMutex && xSemaphoreTake(subscriberMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        localCount = subscriberCount.load();
        for (uint8_t i = 0; i < localCount; i++) {
            localCallbacks[i] = subscribers[i];
        }
        xSemaphoreGive(subscriberMutex);
    } else {
        return;  // Can't get mutex - skip notification
    }

    // Invoke callbacks WITHOUT holding mutex (prevents deadlock on reentrant logging)
    for (uint8_t i = 0; i < localCount; i++) {
        if (localCallbacks[i] != nullptr) {
            localCallbacks[i](level, tag, message);
        }
    }
}

// Global logger getter
Logger& getLogger() {
    return Logger::getInstance();
}